CSI API ETABS v1
cAreaObj.GetNameFromLabel Method
 Retrieves the unique name of an area object, given the label and story level
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetNameFromLabel(
	string Label,
	string Story,
	ref string Name
)
Function GetNameFromLabel (
	Label As String,
	Story As String,
	ByRef Name As String
) As Integer
Dim instance As cAreaObj
Dim Label As String
Dim Story As String
Dim Name As String
Dim returnValue As Integer
returnValue = instance.GetNameFromLabel(Label,
	Story, Name)
int GetNameFromLabel(
	String^ Label,
	String^ Story,
	String^% Name
)
abstract GetNameFromLabel :
        Label : string *
        Story : string *
        Name : string byref -> int
Parameters
Label
Type: System.String
 The area object label
Story
Type: System.String
 The area object story level
Name
Type: System.String
 The unique name of the area object
Return Value
Type: Int32
 Returns zero if the data is successfully retrieved, otherwise it returns nonzero.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim NumberNames As Integer
   Dim Name As String
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'get area object data
   ret = SapModel.AreaObj.GetNameFromLabel("F1", "Story4", Name)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace